# How to import dataset to python from Yahoo Finance

In [ ]:
#pip install yfinance

In [1]:
import yfinance as yf

In [ ]:
yf.

In [5]:
data = yf.download("GC=F")

C:\Users\Brahim\AppData\Local\Temp\ipykernel_9120\1820974823.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  data = yf.download("GC=F")
[*********************100%***********************]  1 of 1 completed

In [6]:
data.head()

Price             Close         High          Low         Open Volume
Ticker             GC=F         GC=F         GC=F         GC=F   GC=F
Date
2025-10-22  4044.399902  4148.500000  4006.000000  4109.700195   1237
2025-10-23  4125.500000  4136.799805  4070.699951  4078.399902    354
2025-10-24  4118.399902  4120.600098  4074.899902  4117.500000    123
2025-10-27  4001.899902  4078.600098  3971.300049  4060.000000    220
2025-10-28  3966.199951  3966.199951  3923.600098  3929.699951    219

In [7]:
data.tail()

Price             Close         High          Low         Open Volume
Ticker             GC=F         GC=F         GC=F         GC=F   GC=F
Date
2025-11-17  4068.300049  4099.500000  4019.399902  4070.000000   1552
2025-11-18  4061.300049  4063.399902  4035.600098  4037.399902   1375
2025-11-19  4077.699951  4122.700195  4072.000000  4086.100098    486
2025-11-20  4056.500000  4090.399902  4040.199951  4045.000000    202
2025-11-21  4076.699951  4085.199951  4031.800049  4031.800049    202

In [8]:
import pandas as pd

In [13]:
data2 = pd.read_csv(r"C:\Users\Brahim\Desktop\Data2.csv")

In [14]:
data2.head()

,Time,GDP,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,1960.0,..,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1961.0,-13.60544132,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1962.0,-19.68504183,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1963.0,34.31372878,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964.0,5.839413008,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
data2.tail()

,Time,GDP,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
67,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
68,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
69,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
70,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
71,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
#From Github

In [18]:
url = "https://raw.githubusercontent.com/brahzr/Time-series-Analysis/refs/heads/main/airline_passengers.csv"

In [19]:
data3 = pd.read_csv(url)

In [20]:
data3.head()

     Month  Thousands of Passengers
0  1949-01                    112.0
1  1949-02                    118.0
2  1949-03                    132.0
3  1949-04                    129.0
4  1949-05                    121.0